---
title: "关于C语言指针-I"
date: 2025-11-06
categories: [Programming, C]
---

## 0x00 关于

本文将记录一些关于C语言指针的注意事项

## 0x01 初始化

指针类型全局变量会被默认初始化为`NULL`（正如int型变量会被初始化为`0`一样），而局部变量则不会被初始化。

因此，为了内存安全，建议在声明时一律将指针初始化为`NULL`。

## 0x01 关于内存操作

动态操作内存时一定要包含`stdlib.h`。

`stdlib.h`含有`malloc()`、`calloc()`、`realloc()`、`free`等重要函数，如果不包含`stdlib.h`而使用这些函数，代码也许能通过编译，但在运行时一定会出问题。

想要快速设置内存时一定要包含`string.h`。

`string.h`含有`memset()`、`memcpy()`、`memmove()`、`memcmp()`四个用于快速操作内存的函数，不包含`string.h`而使用这些函数的后果同上。

## 0x02 引用

C语言中没有任何引用相关语法，因此需要用指针来冒充引用。

```
int a;
int* b = &a;
```

这里b是指向a的指针，但也可通过对`*b`进行操作，使b作为a的引用而被使用。

也可以使用如下的代码创建引用：

```
int a;
int* const b = &a;
```

这里b的指向不能再改变，而a的值是可以改变的，更接近C++中的引用。

## 0x03 const声明

指针声明中可以在`*`符号的前后两个地方含有`const`。

对于`const`在`*`前的情况（无论在`int`前后），此时p指向的内存单元的内容不可经由p修改，也即如下的操作

```
//初始化
int a = 0;
const int p1 = &a;

//操作
*p1 = 1;
```

是错误的。

但是，直接修改被指向的变量、修改指针指向、通过另一指针修改内存单元内容的行为是被允许的，也即如下的操作

```
//初始化
int a = 0, b = 1;
const int p1 = &a;

//操作
a = 1;

int* p2 = &a;
*p2 = 2;

p1 = &b;
```

都是被允许的。

对于`const`在`*`后的情况，此时p的指向不可修改，也即如下的操作

```
//初始化
int a = 0, b = 1;
const int p1 = &a;

//操作
p1 = &b;
```

是错误的。

但是，此时可以通过指针变量修改内存单元内容，也即如下的操作

```
//初始化
int a = 0;
const int p1 = &a;

//操作
*p1 = 1;
```

是被允许的。

## 0x04 结尾

实际上，这篇文章是一时兴起写的，因此严谨性不足。此外，本人是编程新手，以上仅是个人的一些粗浅理解，望请各位读者不吝赐教。